[
  {
    "question": "What Is A Penetration Test?",
    "answer_section1": "Penetration testing, also known as pen testing or ethical hacking, is where you appoint a security testing company to take on the role of a hacker and attempt cyber attacks to compromise or gain unauthorised access to your network, mobile application and/or cloud environment by any means necessary.",
    "answer_section2": "Also known as white hat hacking, a qualified professional, a pen tester, will make use of penetration testing automated tools and manual processes to uncover any vulnerabilities and misconfigurations that present a cyber-security risk.",
    "answer_section3": "As a technical exercise, it involves an internal & external analysis of your IT infrastructures and applications as well as testing human elements (social engineering) therefore penetration tests should be considered a fundamental component of your risk management programme.",
    "answer_section4": "The aim of penetration testing is twofold : Identify and exploit shortcomings in the confidentiality, integrity and availability of information. ",
    "answer_section5": " And should provide remediation advice and offer guidance on how to reduce the impact of the identified shortcomings being exploited."
  },
  {
    "question": "What Are The Benefits & Why Is Penetration Testing So Important?",
    "answer_section1": "It’s recommended that businesses perform penetration tests at least annually or whenever a significant change is made to the environment. Certain compliance packages, such as PCI DSS certification, make regular penetration tests mandatory. Put simply, if you want good security, you need a comprehensive penetration test.",
    "answer_section2": "Testing your current security posture provides a clear indication on where you stand against an ever-changing threat landscape. It’s how you can efficiently identify and address vulnerabilities before an attacker does.",
    "answer_section3": "As technology evolves and your business grows, technical infrastructures become increasingly complex. It’s not uncommon for things to slip out of your control, or you might not have the relevant expertise to ensure that your controls are implemented the right way. Each test reveals the flow of your environment and any interdependencies that have a direct or indirect impact on your business security. Don’t forget that you’re only as secure as your weakest link.",
    "answer_section4": "You might think you have a very secure infrastructure in place, with all the processes, procedures and staff training to back it up. But how do you know? A penetration test is an ideal way to test your security implementations, giving you real-world proof that your security controls are up to standard and working as expected. This can be as much for the benefit of your customers’ and suppliers’ peace of mind as your own.",
    "answer_section5": "Each penetration test addresses your business risks and the impact to confidentiality, integrity and availability of your data. This provides a good indication to management and the technical teams on how to best prioritise, plan, budget and remediate the risks in a structured manner."
  },
  {
    "question": "What Are The Diffrerent Types Of Tests ?",
    "answer_section1": "There are several types of penetration testing that can be defined as either black, white or grey box testing. It’s also worth specifying there is a difference between an application test and an infrastructure test. An application test, as the name suggests, is where a tester looks for flaws within an application to see if there’s any way to get at data or manipulate functionality in a way that wasn’t intended. This can involve cookie theft, XSS, man-in-the-middle attacks etc. Infrastructure tests on the other hand are where the tester attempts to gain entrance to a corporate network.",
    "answer_section2": "Black box testing is the closest simulation of real-world hacking in that the tester will know very little, if anything about the target other than what is publicly available. These are often the least time-consuming tests as it relies solely on the tester discovering vulnerabilities in outwardly facing components. However, whilst these tests accurately represent real life situations, they will not pick up any vulnerabilities or misconfigurations that may be present internally. Therefore, they cannot predict what damage an internal threat may cause.",
    "answer_section3": "White box testing offers the most thorough security test in which the tester has a full understanding of the application or infrastructure, how it works and has access from various levels. It’s likely that they’ll even have access to the source code or have a full detailed map of the internal infrastructure. The tester will probe for vulnerabilities and misconfigurations to try and gain access from an external position, as well as look to see what damage can be done from an internal perspective.",
    "answer_section4": "Grey box testing is a blend of black and white box testing and is often the most popular type of test. The tester will have a limited knowledge of the target, potentially including some documentation. They will often have basic user level access, allowing for partial testing of the target’s internals.",
    "answer_section5": ""
  },
  {
    "question": "What Is The Difference Between A Pentration Test & Vulnerabillity Assessments?",
    "answer_section1": "The two services, whilst very different, are equally as important where cyber security is concerned. Regular vulnerability tests can be run quickly against new builds or networks on a regular (monthly) basis to allow you to patch any vulnerabilities that come to light. Leaving a single vulnerability unchecked on a single device could theoretically compromise your entire infrastructure. Whereas an annual penetration test can offer you a detailed report of your entire security posture, including your susceptibility to social engineering.",
    "answer_section2": "Just because you have had a vulnerability scan, it doesn’t mean you don’t need a penetration test. Likewise, if you’ve recently had a penetration test, it doesn’t mean you won’t benefit from a vulnerability assessment in the near future.",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "What Can I Expect Fron The Report?",
    "answer_section1": "Upon the completion of the penetration testing main stages, the lead penetration tester will present the pen test results in a clear, comprehensive report. This report will be split into two sections: an executive summary and a technical breakdown, typically delivered within five working days after the completion of the penetration test.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "How Much Does A Penetration Test Cost?",
    "answer_section1": "The price of a penetration test can vary widely according to several factors. For this reason, there is no established price range for this type of assessment. Each project is tailored to your objectives and your technological environment. Many factors must be determined before the cost can be established.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "What Is The Difference Between Automated & Manual Tests?",
    "answer_section1": "Automated tests (known as Vulnerability Scanners or Vulnerability Assessments), allow IT teams to identify potential misconfigurations and known vulnerabilities within the versions of their software, operating systems and technologies.",
    "answer_section2": "While automated tests are cost effective and require less expertise to be performed, they do not yield the same level of analysis and cannot identify complex vulnerabilities (Such as logic flaws in applications, or vulnerabilities in custom-built environments). Automated tests may also cause harm to your systems and pollute your databases, so its use should be limited, complementary to manual tests and should be performed by experienced professionals to limit their negative impact.",
    "answer_section3": "Manual tests, on the contrary, requires much more expertise and a deep understanding of various technological contexts. They allow your organization to contextualize their vulnerabilities and provide evidence of their potential impact on your company. They can identify even the most subtle vulnerabilities that could potentially have a critical impact, which automated tests cannot identify, causing as little harm as possible to your systems.",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Who Performs A Penetration Test?",
    "answer_section1": "Pen testing is conducted by our experienced red team of ethical hackers who possess an in-depth understanding of the latest threats and adversarial techniques.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Can Testing Be Condcuted Remotely?",
    "answer_section1": "Many types of penetration testing can be performed remotely via a VPN connection, however some forms of assessment, such as internal network pen testing and wireless pentesting, may require an ethical hacker to conduct an assessment on site.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "How Long Does A Testing Project Usually Last?",
    "answer_section1": "The time required to successfully execute a penetration test depends on the scope and type of test. Most penetration tests can be performed within a couple of days, but some can span over several weeks, sometimes even months depending on the complexity of the project.",
    "answer_section2": " - Small apps, networks, cloud systems: 2-3 days",
    "answer_section3": " - Medium apps, networks, cloud systems: 5-10 days",
    "answer_section4": " - Larger apps, networks, cloud systems: 10 days",
    "answer_section5": ""
  },
  {
    "question": "Do You Recommend Other Tests To Complement Certain Pen Tests?",
    "answer_section1": "Regular and comprehensive assessments of your cyber security are always recommended. The ramifications of security breaches can result in severe financial and reputational losses. We would always advise the safest approach for a company is to regard your cyber security holistically, weaknesses in one area may undermine security implemented elsewhere.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Will My Business Be Disrupted During The Test?",
    "answer_section1": "Testing can be performed against a non-production replica of your live environment, such as a UAT/QA environment, to ensure no risk to your live services. If testing against production is unavoidable, we can coordinate our testing activities to minimise the impact. You can also specify things like no denial of service (DoS), meaning tests will have a negligible impact on your day-to-day operations.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "How Does Immunitas Perform Scoping?",
    "answer_section1": "One of our senior team members will gather information regarding your technical scope, the various technologies in place, allowing us to determine the required efforts for your test. Based on this information, we will assign specific team members with the right skills and experience for your project. Once the scope is well-defined, we will send you a proposal that includes:",
    "answer_section2": " - A list of activities",
    "answer_section3": " - Efforts",
    "answer_section4": " - Methodologies used",
    "answer_section5": " - Delivarbles & Fixed Pricing"
  },
  {
    "question": "How Soon Can You Start My Testing Project?",
    "answer_section1": "While we may be flexible and adapt to your deadlines, the complexity of your project might affect project scoping delays and planning.",
    "answer_section2": "Contact us so we can get your project started right away.",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Does Immunias Perform Penetration Tests In A Live Environment?",
    "answer_section1": "Immunitas will always recommend the safest approach possible for your penetration test. Ideally, the tests will be performed in a testing/dev environment built with the same configurations as the targeted systems. However, our specialists have the expertise to test your systems and applications even if they are in production, without impacting your day-to-day operations.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Can Your Tests Impact My Business Operations?",
    "answer_section1": "Various steps are taken over the course of the project to prevent the potential impact of our tests on the stability of your technological environment and the continuity of your business operations.",
    "answer_section2": "For this reason, a communication plan will be put in place at the beginning of the project to prevent and mitigate any potential impact. A representative of your organization will be identified to act as the main point of contact to ensure rapid communication in the event of a situation directly impacting the conduct of your daily operations, or if any critical vulnerabilities are identified, for which  corrective measures need to be implemented quickly.",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "How Do You Measure The Identified Risks?",
    "answer_section1": "While we use a simple 4 levels risk rating approach (Critical, High, Moderate, Low), our risk assessment is actually based on the Common Vulnerability Scoring System (CVSS) standard. Two main criteria are considered when  assessing the risk level of each vulnerability:",
    "answer_section2": " - Potential impact: The potential impact of an attack based on a vulnerability, combined with its  potential effect on the availability of the system, as well as the confidentiality and integrity of  the data.",
    "answer_section3": " - Exploitability: The potential exploitability of a vulnerability; a vulnerability that is easier to  exploit increases the number of potential attackers and thus the likelihood of an attack.  Different factors are considered when evaluating the exploitability potential of a vulnerability  (e.g.: access vector, authentication, operational complexity, etc.)",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Are Your Tests Performed On-Site?",
    "answer_section1": "The majority of our projects are performed remotely. Modern technologies allow our team to access any kind of infrastructure/systems in a secure manner. We provide various remote access options depending on your specific context.",
    "answer_section2": "In some cases, some specialized types of penetration tests, such as SCADA / ICS / Industrial penetration tests, may require on-site testing, as those systems might not be accessible externally.",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "What Can You Target During A Test?",
    "answer_section1": "There are no projects out of the ordinary for us. We have performed penetration tests in the most diverse environments and on a wide range of technologies. Whether it’s for IoT/smart devices, industrial systems, cloud infrastructures, applications of all types with various API integrations, to corporate networks, we never leave stones unturned no matter your technological context.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "What Happens After The Test Is Completed?",
    "answer_section1": "After each engagement, the pentesters will produce a technical report, detailing each vulnerabilities and recommandations. A comprehensive phone debriefing is conducted following submission of the report to explain each of our findings and their respective recommendations.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "What are the deliverables of a penetration test?",
    "answer_section1": "Pen test deliverables include a series of reports that reveal how security issues were identified and confirmed during the test to determine how the issues should be fixed. Once a penetration test has been completed, the report reveals a list of all network vulnerabilities that were discovered during the test.  In most cases, the report will also provide recommendations on how to fix the issues.",
    "answer_section2": "A typical penetration testing report will include a complete review of the project, the techniques and methodologies used during the test, security risk levels in order of priority, recommendations for fixing the issues, and suggestions for tightening up network security as a whole.",
    "answer_section3": "There is also a report for presentation to management which explains in non-technical terms how the risks can affect business continuity and potential financial losses that can be incurred as the result of a breach. This part of the report may also include the IT investments which may be necessary to improve network security.",
    "answer_section4": "The bottom line is penetration testing is well worth the investment for any SMB that wants the peace of mind knowing the network is secure and daily business operations can continue in the event of a service disruption. Penetration testing can be compared to products that are tested prior to being released on the market.",
    "answer_section5": "Automobile manufacturers test a car before releasing it on the market to ensure the vehicle is safe.  This means putting the car through simulated accident situations to ensure it will be safe in the event of a real accident.Penetration testing with regard to network intrusions works the same.  If you fail to test the security controls and network environment prior to use, it is impossible to ensure security in the event of an exploit by hackers.  This is why pen tests make sense for organisations of all sizes."
  },
  {
    "question": "I need a pentest report ASAP, can Immunitas help me?",
    "answer_section1": "Absolutely! Being flexible and on-demand is a key part of our pentest offering.Contact one of our specialists so we can get your project started right away.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "How Does Immunitas Ensure The Quality Our Reports?",
    "answer_section1": "During each engagement, a Pentest Senior Team Member is responsible for ensuring that each individual finding and the overall report meets our high level of quality standards, based on the ISO9001 standard and leveraging our years of refined expertise to ensure the best outcome for every project.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "Can You Perform A Retest To Validate The Fixes We Implemented?",
    "answer_section1": "Absolutely! We can retest the identified vulnerabilities to validate the implementation of our recommended corrective measures and depending on your needs, provide an attestation that previously identified vulnerabilities have been successfully fixed.",
    "answer_section2": "This will allow your organization to meet regulatory compliance requirements, or to comply with third-party requests, while ensuring that no additional vulnerabilities have been introduced during the implementation of the corrective measures.",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  },
  {
    "question": "What Happens If I Don’t Fully Understand A Vulnerability Report Submitted By The Techincian.",
    "answer_section1": "Communication is key! You can write comments directly to the pentesters asking them to clarify a specific report. You can also write internal comments to your team members to enhance collaboration. We also know that pentest findings don’t always get fixed right away, so we allow direct communication with the pentesters for months following the completed pentest engagement.",
    "answer_section2": "",
    "answer_section3": "",
    "answer_section4": "",
    "answer_section5": ""
  }
]